Repository: mousajumah87/mw-chat
Catalog: lib/l10n/app_*.arb
Languages: ar

# mainTitle
source: MW
ar: MW شات

# loginTitle
source: Welcome back
ar: مرحباً بعودتك

# createAccount
source: Create your MW account
ar: إنشاء حساب MW

source: Create new account
ar: إنشاء حساب جديد

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: First name
ar: الاسم الأول

source: Last name
ar: اسم العائلة

source: Birthday
ar: تاريخ الميلاد

source: Select birthday
ar: اختر تاريخ الميلاد

source: Gender
ar: الجنس

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Prefer not to say
ar: أفضل عدم الإفصاح

source: Choose picture
ar: اختر صورة

# choosePictureTooltip
source: Tap to choose a picture
ar: اضغط لاختيار صورة

source: Login
ar: تسجيل الدخول

source: Register
ar: إنشاء حساب

# requiredField
source: Required
ar: حقل مطلوب

source: Invalid email
ar: بريد إلكتروني غير صالح

# minPassword
source: Minimum 6 characters
ar: كلمة المرور لا تقل عن 6 أحرف

# authError
source: Authentication error
ar: خطأ في المصادقة

source: Failed to create user
ar: فشل إنشاء المستخدم

# settingUpProfile
source: Setting up your profile...
ar: جارٍ إعداد ملفك الشخصي...

# accountNotActive
source: Your account is not active yet.
ar: حسابك غير مفعّل بعد.

# waitForActivation
source: Please wait until your account is activated by the admin.
ar: يرجى الانتظار حتى يتم تفعيل حسابك من قبل المسؤول.

source: Not logged in
ar: غير مسجل الدخول

source: Logout
ar: تسجيل الخروج

# logoutTooltip
source: Logout
ar: تسجيل الخروج

source: Go back
ar: الرجوع

# profileTitle
source: Profile
ar: الملف الشخصي

source: Profile updated
ar: تم تحديث الملف الشخصي

source: Saving...
ar: جارٍ الحفظ...

source: Save
ar: حفظ

# saveFailed
source: Save failed: {error}
ar: فشل الحفظ: {error}

# userProfileTitle
source: User profile
ar: الملف الشخصي للمستخدم

source: User not found
ar: المستخدم غير موجود

# ageLabel
source: Age
ar: العمر

# birthdayLabel
source: Birthday
ar: تاريخ الميلاد

# genderLabel
source: Gender
ar: الجنس

source: Not specified
ar: غير محدد

source: Unknown
ar: غير معروف

# usersTitle
source: Friends
ar: الأصدقاء

# mwUsersTabTitle
source: MW Friends
ar: أصدقاء MW

source: Not activated
ar: غير مفعّل

source: Online
ar: متصل

source: Offline
ar: غير متصل

source: Last seen just now
ar: آخر ظهور الآن

# lastSeenMinutes
source: Last seen {minutes} min ago
ar: آخر ظهور منذ {minutes} دقيقة

# lastSeenHours
source: Last seen {hours} h ago
ar: آخر ظهور منذ {hours} ساعة

# lastSeenDays
source: Last seen {days} d ago
ar: آخر ظهور منذ {days} يوم

# noOtherUsers
source: No other friends yet
ar: لا يوجد أصدقاء آخرون

# typeMessageHint
source: Type a message...
ar: اكتب رسالة...

# isTyping
source: {name} is typing...
ar: {name} يكتب...

source: No messages yet
ar: لا توجد رسائل بعد

# sendFailed
source: Failed to send message. Please try again.
ar: فشل إرسال الرسالة. يرجى المحاولة مرة أخرى.

source: Attach file
ar: إرفاق ملف

source: Attachment
ar: مرفق

source: 📷 Photo
ar: 📷 صورة

# photoWithName
source: 📷 Photo: {fileName}
ar: 📷 صورة: {fileName}

source: 🎬 Video
ar: 🎬 فيديو

# videoWithName
source: 🎬 Video: {fileName}
ar: 🎬 فيديو: {fileName}

source: 🎵 Audio
ar: 🎵 صوت

# audioWithName
source: 🎵 Audio: {fileName}
ar: 🎵 صوت: {fileName}

source: 📎 File
ar: 📎 ملف

# fileWithName
source: 📎 File: {fileName}
ar: 📎 ملف: {fileName}

source: Failed to upload file
ar: فشل رفع الملف

source: Upload failed (storage).
ar: فشل الرفع (التخزين).

source: Upload failed (message save).
ar: فشل الرفع (حفظ الرسالة).

# attachPhotoFromGallery
source: Photo from gallery
ar: صورة من المعرض

# attachVideoFromGallery
source: Video from gallery
ar: فيديو من المعرض

# attachTakePhoto
source: Take a photo
ar: التقاط صورة

# attachRecordVideo
source: Record a video
ar: تسجيل فيديو

# attachFileFromDevice
source: File from device
ar: ملف من الجهاز

# voiceNotSupportedWeb
source: Voice messages are not supported on Web yet.
ar: الرسائل الصوتية غير مدعومة على الويب بعد.

# microphonePermissionRequired
source: Microphone permission is required to record audio.
ar: يتطلب تسجيل الصوت منح إذن الوصول إلى الميكروفون.

# holdMicToRecord
source: Hold the mic to record a voice message
ar: اضغط باستمرار على الميكروفون لتسجيل رسالة صوتية

# deleteMessageTitle
source: Delete message
ar: حذف الرسالة

# deleteMessageConfirm
source: Are you sure you want to delete this message?
ar: هل أنت متأكد أنك تريد حذف هذه الرسالة؟

# deleteFailed
source: Failed to delete the message. Please try again.
ar: فشل حذف الرسالة. يرجى المحاولة مرة أخرى.

# deleteChatTitle
source: Delete chat
ar: حذف المحادثة

# deleteChatWarning
source: Are you sure you want to delete this chat? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذه المحادثة؟ لا يمكن التراجع عن هذا الإجراء.

source: Delete
ar: حذف

source: Cancel
ar: إلغاء

# chatDeleted
source: Chat deleted successfully
ar: تم حذف المحادثة بنجاح

# chatHistoryDeleteFailed
source: Failed to delete chat history
ar: فشل حذف سجل المحادثة

# deleteChatDescription
source: Are you sure you want to delete this chat history? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف سجل هذه المحادثة؟ لا يمكن التراجع عن هذا الإجراء.

# chatHistoryDeleted
source: Chat history deleted successfully
ar: تم حذف سجل المحادثة بنجاح

source: Invite
ar: دعوة

# inviteFriendsTitle
source: Invite Friends
ar: دعوة الأصدقاء

# inviteContactsTabTitle
source: Invite Contacts
ar: دعوة جهات الاتصال

# inviteFromContactsFuture
source: Invite your friends to MW Chat and stay connected.
ar: دعوة الأصدقاء مباشرةً من جهات الاتصال ستكون متاحة في تحديث قادم من تطبيق MW Chat.

# inviteShareManual
source: You can download MW Chat using the links below:
ar: حالياً، يمكنك مشاركة تطبيق MW Chat مع أصدقائك من خلال إرسال رابط التطبيق لهم يدوياً.

# contactsPermissionDenied
source: We can’t access your contacts. Please enable contacts permission in Settings.
ar: لا يمكننا الوصول إلى جهات الاتصال لديك. يرجى تفعيل إذن جهات الاتصال من الإعدادات لدعوة أصدقائك.

# noContactsFound
source: No contacts with phone numbers were found.
ar: لا توجد جهات اتصال تحتوي على أرقام هاتف.

# inviteSubject
source: Join me on MW Chat
ar: انضم إليّ في MW Chat

# inviteMessageTemplate
source: Hi {name}, I’m using MW Chat to stay in touch. Download it here: Android: {androidLink} iOS: {iosLink} See you there!
ar: مرحباً {name}، أستخدم تطبيق MW Chat للتواصل. يمكنك تحميله من هنا: أندرويد: {androidLink} آيفون: {iosLink} أراك هناك!

# inviteSent
source: Invite sent to {name}
ar: تم إرسال الدعوة إلى {name}

# inviteWebNotSupported
source: Inviting contacts is not supported on web.
ar: دعوة جهات الاتصال من دفتر العناوين غير مدعومة على نسخة الويب. يرجى استخدام تطبيق الهاتف بدلاً من ذلك.

source: Search
ar: بحث

source: Retry
ar: إعادة المحاولة

# unknownEmail
source: Unknown
ar: غير معروف

# addFriendTooltip
source: Add friend
ar: إضافة صديق

# friendRequestedChip
source: Requested
ar: بانتظار الموافقة

# friendAcceptTooltip
source: Accept
ar: قبول

# friendDeclineTooltip
source: Decline
ar: رفض

# friendSectionRequests
source: Friend requests
ar: طلبات الصداقة

# friendSectionYourFriends
source: Your friends
ar: أصدقاؤك

# friendSectionAllUsers
source: All MW users
ar: جميع مستخدمي MW

# friendSectionInactiveUsers
source: Inactive users
ar: المستخدمون غير النشطين

source: Friend request sent
ar: تم إرسال طلب الصداقة

# friendRequestSendFailed
source: Failed to send friend request
ar: فشل في إرسال طلب الصداقة

source: Friend request accepted
ar: تم قبول طلب الصداقة

# friendRequestAcceptFailed
source: Failed to accept friend request
ar: فشل في قبول طلب الصداقة

source: Friend request declined
ar: تم رفض طلب الصداقة

# friendRequestDeclineFailed
source: Failed to decline friend request
ar: فشل في رفض طلب الصداقة

# friendshipInfoOutgoing
source: Friend request sent. Please wait for approval.
ar: تم إرسال طلب الصداقة. يرجى الانتظار لحين الموافقة.

# friendshipInfoIncoming
source: You have a friend request pending. Accept it to start chatting.
ar: لديك طلب صداقة معلق. قم بقبوله لبدء الدردشة.

# friendshipInfoNotFriends
source: You need to be friends to send messages.
ar: يجب أن تكون صديقًا لهذا المستخدم لتتمكن من إرسال الرسائل.

# friendshipFileInfoOutgoing
source: Friend request sent. You can send files once it is accepted.
ar: تم إرسال طلب الصداقة. يمكنك إرسال الملفات بعد قبول الطلب.

# friendshipFileInfoIncoming
source: You have a friend request pending. Accept it to share files.
ar: لديك طلب صداقة معلق. قم بقبوله لمشاركة الملفات.

# friendshipFileInfoNotFriends
source: Send a friend request to start sharing files.
ar: أرسل طلب صداقة لبدء مشاركة الملفات.

# friendshipBannerNotFriends
source: You’re not friends with {name} yet. Send a friend request to start chatting.
ar: أنت لست صديقًا لـ {name} بعد. أرسل طلب صداقة لبدء الدردشة.

# friendshipBannerSendRequestButton
source: Send request
ar: إرسال طلب

# friendshipBannerIncoming
source: {name} sent you a friend request.
ar: {name} أرسل لك طلب صداقة.

# friendshipBannerOutgoing
source: Friend request sent. Waiting for {name} to accept.
ar: تم إرسال طلب الصداقة. بانتظار موافقة {name}.

# friendshipCannotSendOutgoing
source: Friend request sent. You can start chatting once it is accepted.
ar: تم إرسال طلب الصداقة. ستتمكن من الدردشة بعد قبول الطلب.

# friendshipCannotSendIncoming
source: Accept the friend request above to start chatting.
ar: قم بقبول طلب الصداقة أعلاه لبدء الدردشة.

# friendshipCannotSendNotFriends
source: Send a friend request above to start chatting.
ar: أرسل طلب صداقة أعلاه لبدء الدردشة.

# blockUserTitle
source: Block user
ar: حظر المستخدم

# blockUserDescription
source: Blocking this user prevents them from contacting you.
ar: سيؤدي حظر هذا المستخدم إلى منعه من التواصل معك، ولن تتلقى رسائل جديدة منه.

# userBlocked
source: User has been blocked.
ar: تم حظر المستخدم.

# userBlockedInfo
source: You have blocked this user. You cannot send or receive new messages with them.
ar: لقد قمت بحظر هذا المستخدم. لا يمكنك إرسال أو استقبال رسائل جديدة معه.

# blockedUserBanner
source: You have blocked this user. You will no longer receive their messages.
ar: لقد قمت بحظر هذا المستخدم. لن تصلك رسائل منه بعد الآن.

# blockedByUserBanner
source: This user has blocked you. You cannot send messages in this chat.
ar: قام هذا المستخدم بحظرك. لا يمكنك إرسال رسائل في هذه المحادثة.

# unblockUserTitle
source: Unblock user
ar: إلغاء حظر المستخدم

# unblockUserDescription
source: Do you want to unblock this user? You will start seeing new messages from them again.
ar: هل تريد إلغاء حظر هذا المستخدم؟ ستبدأ برؤية الرسائل الجديدة منه مرة أخرى.

# unblockUserConfirm
source: Unblock
ar: إلغاء الحظر

source: User unblocked
ar: تم إلغاء حظر المستخدم

# removeFriendTitle
source: Remove friend
ar: إزالة الصديق

# removeFriendDescription
source: This will remove this person from your friends list. You can still chat with them if your privacy settings allow it.
ar: سيتم إزالة هذا الشخص من قائمة أصدقائك. ما زال بإمكانك الدردشة معه إذا سمحت إعدادات الخصوصية بذلك.

# removeFriendConfirm
source: Remove
ar: إزالة

source: Friend removed
ar: تمت إزالة الصديق

# reportMessageTitle
source: Report message
ar: الإبلاغ عن رسالة

# reportMessageHint
source: Describe why you are reporting this message (harassment, spam, inappropriate content, etc.)
ar: صف سبب الإبلاغ عن هذه الرسالة (تحرش، إزعاج، محتوى غير لائق، إلخ...)

# reportUserTitle
source: Report user
ar: الإبلاغ عن مستخدم

# reportUserHint
source: Describe the problem (harassment, spam, inappropriate content, etc.)
ar: صف المشكلة (تحرش، إزعاج، محتوى غير لائق، إلخ...)

# reportUserReasonLabel
source: Reason
ar: السبب

# reportSubmitted
source: Thank you. Your report has been submitted.
ar: شكراً لك. تم إرسال بلاغك لمراجعته.

# messageContainsRestrictedContent
source: Your message contains language that is not allowed in MW Chat.
ar: رسالتك تحتوي على كلمات غير مسموح بها في MW Chat.

# contentBlockedTitle
source: Message not sent
ar: لم يتم إرسال الرسالة

# contentBlockedBody
source: Your message contains words that are not allowed in MW Chat. Please edit and try again.
ar: تحتوي رسالتك على كلمات غير مسموح بها في تطبيق MW Chat. يرجى تعديلها والمحاولة مرة أخرى.

# dangerZone
source: Sensitive actions
ar: إجراءات حساسة

source: Optional
ar: اختياري

# reasonHarassment
source: Harassment or bullying
ar: التحرش أو التنمر

# reasonSpam
source: Spam or scam
ar: الرسائل المزعجة أو الاحتيال

# reasonHate
source: Hate or abusive content
ar: الكراهية أو المحتوى المسيء

# reasonSexual
source: Sexual or inappropriate content
ar: محتوى جنسي أو غير لائق

# reasonOther
source: Other
ar: أخرى

source: Deleting account...
ar: جاري حذف الحساب...

source: Delete my account
ar: حذف حسابي

# deleteAccountWarning
source: This will permanently delete your account, your messages, and all associated data. This action cannot be undone.
ar: سيؤدي هذا إلى حذف حسابك ورسائلك وبياناتك بشكل دائم. لا يمكن التراجع عن هذا الإجراء.

# deleteAccountDescription
source: Deleting your account will permanently remove your profile, messages, and associated data.
ar: سيؤدي حذف حسابك إلى إزالة ملفك الشخصي ورسائلك وبياناتك المرتبطة بشكل دائم.

# loginAgainToDelete
source: Please log in again and retry account deletion.
ar: يرجى تسجيل الدخول مرة أخرى ثم إعادة محاولة حذف الحساب

# deleteAccountFailed
source: Failed to delete account.
ar: فشل حذف الحساب.

# deleteAccountFailedRetry
source: Failed to delete account. Please try again.
ar: فشل حذف الحساب. يرجى المحاولة مرة أخرى.

source: Account deleted successfully
ar: تم حذف الحساب بنجاح

# termsTitle
source: Terms of Use
ar: شروط الاستخدام

# termsAcceptButton
source: I Agree
ar: أوافق

# termsBody
source: Welcome to MW Chat! By using this app, you agree to the following Terms of Use: 1. No tolerance for objectionable content • Do not send or share content that is hateful, harassing, threatening, sexually explicit, violent, discriminatory, or harmful. • Do not bully, abuse, or intimidate others. • Do not impersonate others or use MW Chat for fraud or illegal activity. 2. User-generated content • You are responsible for the messages and content you send. • MW Chat may remove any content that violates these terms. • MW Chat may suspend or permanently ban users who violate these rules. 3. Reporting and blocking • MW Chat provides tools to report users and block abusive users. • Reports are reviewed promptly, and we act on objectionable content within 24 hours by removing the content and/or disabling offending accounts. 4. Privacy and safety • Do not share sensitive personal information inside chats. • Review our Privacy Policy for more details on data handling. 5. Account termination • MW Chat may restrict or terminate your access if you violate these terms. If you encounter abusive content or behavior, contact us at support@mwchats.com. By tapping "I Agree", you accept these Terms of Use.
ar: مرحباً بك في MW Chat! باستخدامك لهذا التطبيق، فإنك توافق على شروط الاستخدام التالية: 1. عدم التسامح مع المحتوى غير اللائق • يُمنع إرسال أو مشاركة أي محتوى يتسم بالكراهية أو التحرش أو التهديد أو الإيحاءات الجنسية أو العنف أو التمييز أو أي محتوى ضار. • يُمنع التنمر أو الإساءة أو الترهيب لأي مستخدم آخر. • يُمنع انتحال شخصية الآخرين أو استخدام MW Chat للاحتيال أو أي نشاط غير قانوني. 2. المحتوى الذي ينشئه المستخدمون • أنت تتحمل المسؤولية الكاملة عن الرسائل والمحتوى الذي ترسله. • يحق لتطبيق MW Chat إزالة أي محتوى يخالف هذه الشروط. • يحق لتطبيق MW Chat تعليق أو حظر أي مستخدم ينتهك هذه القواعد بشكل مؤقت أو دائم. 3. الإبلاغ والحظر • يوفر MW Chat أدوات للإبلاغ عن المستخدمين وحظرهم في حال إساءة الاستخدام. • تتم مراجعة البلاغات بسرعة، ونعمل على اتخاذ الإجراءات المناسبة خلال 24 ساعة، بما في ذلك إزالة المحتوى المسيء و/أو تعطيل حساب المستخدم المخالف عند الحاجة. 4. الخصوصية والسلامة • يُنصح بعدم مشاركة معلومات شخصية حساسة (مثل كلمات المرور أو المعلومات المالية أو الوثائق الرسمية) داخل المحادثات. • لمزيد من التفاصيل حول كيفية تعاملنا مع بياناتك، يُرجى مراجعة سياسة الخصوصية. 5. إنهاء الاستخدام • في حال مخالفة شروط الاستخدام، قد يقوم MW Chat بتقييد أو إنهاء وصولك إلى الخدمة دون إشعار مسبق. إذا واجهت سلوكاً مسيئاً أو محتوى غير لائق، أو كانت لديك أسئلة حول هذه الشروط، يمكنك التواصل معنا عبر البريد الإلكتروني: support@mwchats.com. بالنقر على "أوافق"، فإنك تؤكد أنك قرأت هذه الشروط وفهمتها وتوافق عليها.

# byRegisteringYouAgree
source: By creating an account, you agree to the MW Chat Terms of Use.
ar: من خلال إنشاء حساب، فإنك توافق على شروط الاستخدام الخاصة بتطبيق MW Chat.

# viewTermsLink
source: View Terms of Use
ar: عرض شروط الاستخدام

# iAgreeTo
source: I agree to the MW Chat Terms of Use
ar: أوافق على شروط استخدام MW Chat

source: View Terms of Use
ar: عرض شروط الاستخدام

source: Terms of Use
ar: شروط الاستخدام

source: I Agree
ar: أوافق

# mustAcceptTerms
source: You must accept the Terms of Use before registering.
ar: يجب عليك الموافقة على شروط الاستخدام قبل إنشاء الحساب.

source: Contact support
ar: الاتصال بالدعم

source: About
ar: حول

source: Website
ar: الموقع الإلكتروني

# aboutTitle
source: About MW Chat
ar: حول MW Chat

# aboutDescription
source: MW Chat is a modern private messaging app designed for secure and smooth communication. Chat with friends, send photos, videos, and voice messages through a clean and simple interface. Features: • Real-time messaging • Media sharing • Secure authentication • Simple & elegant design • Fast and lightweight
ar: ‏MW Chat هو تطبيق مراسلة حديث للرسائل الخاصة، مُصمَّم لتواصل آمن وسلس. يمكنك الدردشة مع الأصدقاء، وإرسال الصور والفيديوهات والرسائل الصوتية من خلال واجهة بسيطة وسهلة الاستخدام. يركّز MW Chat على الخصوصية والسرعة والبساطة. المميزات: • رسائل فورية في الوقت الحقيقي • مشاركة الوسائط (صور وفيديوهات) • تسجيل دخول آمن • تصميم بسيط وأنيق • تطبيق سريع وخفيف سواء للمحادثات الشخصية أو العائلية، يبقيك MW Chat على تواصل آمن وممتع.

# legalTitle
source: Legal
ar: الجانب القانوني

# copyrightText
source: MW Chat – modern private messaging app. Copyright © 2025 Mousa Abu Hilal.
ar: MW Chat – تطبيق مراسلة حديث للرسائل الخاصة. حقوق النشر © 2025 موسى أبو هلال. جميع الحقوق محفوظة.

source: All rights reserved.
ar: جميع الحقوق محفوظة.

# cancelFriendRequestTitle
source: Cancel friend request
ar: إلغاء طلب الصداقة

# cancelFriendRequestDescription
source: Do you want to cancel this friend request?
ar: هل تريد إلغاء طلب الصداقة هذا؟

# cancelFriendRequestConfirm
source: Cancel request
ar: إلغاء الطلب

source: Friend request cancelled
ar: تم إلغاء طلب الصداقة

# friendRequestIncomingBanner
source: This user sent you a friend request.
ar: قام هذا المستخدم بإرسال طلب صداقة إليك.

# sidePanelAppName
source: MW Chat
ar: MW شات

# sidePanelTagline
source: Stay close to your favorite people.
ar: ابق قريباً من أحبّ الناس إليك.

# sidePanelMissingMascotsHint
source: Add your MW mascots image to assets/images/mw_bear_and_smurf.png
ar: أضِف صورة شخصيات MW إلى المسار assets/images/mw_bear_and_smurf.png

# sidePanelFeatureTitle
source: Why people love MW
ar: لماذا يحبّ الناس MW

# sidePanelFeaturePrivate
source: Private 1:1 conversations.
ar: محادثات خاصة فردية مع الأشخاص المقرّبين منك.

# sidePanelFeatureStatus
source: Online status and last seen indicators.
ar: حالة الاتصال وآخر ظهور لتعرف متى يكون الأصدقاء متاحين.

# sidePanelFeatureInvite
source: Invite friends with one tap.
ar: ادعُ أصدقاءك من جهات الاتصال بضغطة واحدة.

# sidePanelTip
source: Tip: online Friends appear at the top.
ar: نصيحة: الأصدقاء المتصلون يظهرون في الأعلى. اضغط على أي صديق لبدء المحادثة فوراً.

# sidePanelFollowTitle
source: Follow MW
ar: تابِع MW

# socialFacebook
source: Facebook
ar: فيسبوك

# socialInstagram
source: Instagram
ar: إنستغرام

# socialX
source: X / Twitter
ar: إكس / تويتر

# appBrandingBeta
source: MW Chat 2025
ar: MW شات 2025 نسخة تجريبية

# profileSafetyToolsSectionTitle
source: Safety tools
ar: أدوات السلامة

# profileBlockedUserHintLimitedVisibility
source: This user has limited what you can see.
ar: قام هذا المستخدم بتقييد ما يمكنك رؤيته.

# profileBlockDialogTitleBlock
source: Block user
ar: حظر المستخدم

# profileBlockDialogTitleUnblock
source: Unblock user
ar: إلغاء حظر المستخدم

# profileBlockDialogBodyBlock
source: Do you want to block this user? You will no longer receive messages from them in MW Chat.
ar: هل تريد حظر هذا المستخدم؟ لن تتلقى رسائل منه في تطبيق MW Chat بعد الآن.

# profileBlockDialogBodyUnblock
source: Do you want to unblock this user? You will be able to receive messages from them again.
ar: هل تريد إلغاء حظر هذا المستخدم؟ ستتمكن من استقبال الرسائل منه مرة أخرى.

# profileBlockDialogConfirmBlock
source: Block
ar: حظر

# profileBlockDialogConfirmUnblock
source: Unblock
ar: إلغاء الحظر

# profileBlockButtonBlock
source: Block user
ar: حظر المستخدم

# profileBlockButtonUnblock
source: Unblock user
ar: إلغاء حظر المستخدم

# profileBlockSnackbarBlocked
source: User blocked successfully.
ar: تم حظر المستخدم بنجاح.

# profileBlockSnackbarUnblocked
source: User unblocked.
ar: تم إلغاء حظر المستخدم.

# profileBlockSnackbarError
source: Failed to update block status. Please try again.
ar: فشل تحديث حالة الحظر. يرجى المحاولة مرة أخرى.

# profileReportDialogTitle
source: Report user
ar: الإبلاغ عن مستخدم

# profileReportDialogBody
source: Please describe why you are reporting this user. For example: spam, bullying, hate speech, or other abusive content.
ar: يرجى وصف سبب الإبلاغ عن هذا المستخدم، مثل: الرسائل المزعجة، التنمر، خطاب الكراهية، أو أي محتوى مسيء آخر.

# profileReportDialogHint
source: Describe the problem…
ar: صف المشكلة…

# profileReportDialogSubmit
source: Submit
ar: إرسال البلاغ

# profileReportButtonLabel
source: Report user
ar: الإبلاغ عن المستخدم

# profileReportSnackbarSuccess
source: Report submitted. We will review it.
ar: تم إرسال البلاغ. سنقوم بمراجعته.

# profileReportSnackbarError
source: Failed to submit report. Please try again.
ar: فشل إرسال البلاغ. يرجى المحاولة مرة أخرى.
